package com.avenue.java.spb.group2.lesson9.homework;

public class homework9 {
    public static void main(String[] args) {
        /*1

        Создать класс Animal и расширяющие его классы Dog, Cat, Horse.
        Класс Animal содержит переменные food, location и методы makeNoise, eat, sleep. Метод makeNoise, например, может выводить на консоль "Такое-то животное спит".
                Dog, Cat, Horse переопределяют методы makeNoise, eat.
                Добавьте переменные в классы Dog, Cat, Horse, характеризующие только этих животных.
                Создайте класс Ветеринар, в котором определите метод void treatAnimal(Animal animal). Пусть этот метод распечатывает food и location пришедшего на прием животного.
                В методе main создайте массив типа Animal, в который запишите животных всех имеющихся у вас типов. В цикле отправляйте их на прием к ветеринару.*/


        /*2

        Создать класс Товар, имеющий переменные имя, цена, рейтинг.
        Создать класс Категория, имеющий переменные имя и массив товаров. Создать несколько объектов класса Категория.
                Создать класс Basket, содержащий массив купленных товаров.
                Создать класс User, содержащий логин, пароль и объект класса Basket. Создать объект класса User.*/

        /*3

        Создать класс Person, который содержит:

        переменные fullName, age;
        методы move() и talk(), в которых просто вывести на консоль сообщение -"Такой-то  Person говорит".
                Добавьте два конструктора  - Person() и Person(fullName, age).
        Создайте два объекта этого класса. Один объект инициализируется конструктором Person(), другой - Person(fullName, age).*/

    }
}
